# HasReflection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..HasReflection Property
Transform Class See Also
---
The boolean value that indicates whether this transformation produces reflection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HasReflection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasReflection As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasReflection {
	bool get ();
}
```

# Remarks
Reflection transformation changes the handedness of a coordinate system.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when this transformation is not conformal and the reflection is undefined. |

# See Also
Transform Class
Autodesk.Revit.DB Namespace